/** middle 岛屿的最大面积
 * 给定一个包含了一些 0 和 1 的非空二维数组 grid 。

  一个 岛屿 是由一些相邻的 1 (代表土地) 构成的组合，这里的「相邻」要求两个 1 必须在水平或者竖直方向上相邻。你可以假设 grid 的四个边缘都被 0（代表水）包围着。

  找到给定的二维数组中最大的岛屿面积。(如果没有岛屿，则返回面积为 0 。)

  [[0,0,1,0,0,0,0,1,0,0,0,0,0],
  [0,0,0,0,0,0,0,1,1,1,0,0,0],
  [0,1,1,0,1,0,0,0,0,0,0,0,0],
  [0,1,0,0,1,1,0,0,1,0,1,0,0],
  [0,1,0,0,1,1,0,0,1,1,1,0,0],
  [0,0,0,0,0,0,0,0,0,0,1,0,0],
  [0,0,0,0,0,0,0,1,1,1,0,0,0],
  [0,0,0,0,0,0,0,1,1,0,0,0,0]]
  对于上面这个给定矩阵应返回 6。注意答案不应该是 11 ，因为岛屿只能包含水平或垂直的四个方向的 1 
 */

/**
 * 
 * 沉岛思维 找到对应的点 直接修改为 0 然后 递归 上下左右 计数
 */
test()
function maxAreaOfIsland(grid) {
  let total = 0
  for (let i = 0; i < grid.length; i++) {
    for (let j = 0; j < grid[i].length; j++) {
      total = Math.max(total, dfs(i, j, grid))
    }
  }
  return total
}

function dfs(i, j, grid) {
  if (i < 0 || j < 0 || i >= grid.length || j >= grid[0].length) return 0 // 越界判断
  if (grid[i][j] === 0) return 0 // 不是岛屿  终止向外延伸
  grid[i][j] = 0 // 沉岛操作 
  let total = 1
  
  total += dfs(i + 1, j, grid) // 下
  total += dfs(i - 1, j, grid) // 上
  total += dfs(i, j + 1, grid) // 右
  total += dfs(i, j - 1, grid) // 左
  return total
}

function test() {
  const grid = [
    [0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
    [0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0],
    [0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0],
  ]
  console.log('', maxAreaOfIsland(grid))
}